### Terragrunt Plan :memo:

<details>
<summary>Terragrunt Plan Logs</summary>

```text
00:06:45.546 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./aliyun
- Module ./hosts


00:06:46.196 INFO   [hosts] tofu: Initializing the backend...
00:06:46.600 INFO   [hosts] tofu: 
00:06:46.600 INFO   [hosts] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
00:06:46.601 INFO   [hosts] tofu: use this backend unless the backend configuration changes.
00:06:46.963 INFO   [hosts] tofu: Initializing modules...
00:06:46.963 INFO   [hosts] tofu: - nixos_deploy in ../modules/nixos_deploy
00:06:46.964 INFO   [hosts] tofu: Initializing provider plugins...
00:06:46.964 INFO   [hosts] tofu: - Reusing previous version of linyinfeng/shell from the dependency lock file
00:06:47.352 INFO   [hosts] tofu: - Using linyinfeng/shell v1.7.13 from the shared cache directory
00:06:47.365 INFO   [hosts] tofu: OpenTofu has been successfully initialized!
00:06:56.610 STDOUT [hosts] tofu: No changes. Your infrastructure matches the configuration.
00:06:56.610 STDOUT [hosts] tofu: OpenTofu has compared your real infrastructure against your configuration and
00:06:56.610 STDOUT [hosts] tofu: found no differences, so no changes are needed.
00:07:21.764 INFO   [aliyun] tofu: Initializing the backend...
00:07:22.166 INFO   [aliyun] tofu: 
00:07:22.167 INFO   [aliyun] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
00:07:22.167 INFO   [aliyun] tofu: use this backend unless the backend configuration changes.
00:07:22.499 INFO   [aliyun] tofu: Initializing modules...
00:07:22.500 INFO   [aliyun] tofu: - sg in ../modules/aliyun_security_group
00:07:22.500 INFO   [aliyun] tofu: - vpc in ../modules/aliyun_vpc
00:07:22.501 INFO   [aliyun] tofu: Initializing provider plugins...
00:07:22.501 INFO   [aliyun] tofu: - Reusing previous version of aliyun/alicloud from the dependency lock file
00:07:23.170 INFO   [aliyun] tofu: - Using aliyun/alicloud v1.248.0 from the shared cache directory
00:07:23.447 INFO   [aliyun] tofu: OpenTofu has been successfully initialized!
00:07:29.093 STDOUT [aliyun] tofu: OpenTofu used the selected providers to generate the following execution
00:07:29.093 STDOUT [aliyun] tofu: plan. Resource actions are indicated with the following symbols:
00:07:29.093 STDOUT [aliyun] tofu:   + create
00:07:29.093 STDOUT [aliyun] tofu: OpenTofu will perform the following actions:
00:07:29.093 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["tcp:0.0.0.0/0:25565"] will be created
00:07:29.093 STDOUT [aliyun] tofu:   + resource "alicloud_security_group_rule" "this" {
00:07:29.093 STDOUT [aliyun] tofu:       + cidr_ip                = "0.0.0.0/0"
00:07:29.093 STDOUT [aliyun] tofu:       + id                     = (known after apply)
00:07:29.093 STDOUT [aliyun] tofu:       + ip_protocol            = "tcp"
00:07:29.093 STDOUT [aliyun] tofu:       + nic_type               = "intranet"
00:07:29.093 STDOUT [aliyun] tofu:       + policy                 = "accept"
00:07:29.093 STDOUT [aliyun] tofu:       + port_range             = "25565/25565"
00:07:29.093 STDOUT [aliyun] tofu:       + prefix_list_id         = (known after apply)
00:07:29.093 STDOUT [aliyun] tofu:       + priority               = 1
00:07:29.093 STDOUT [aliyun] tofu:       + security_group_id      = "sg-bp1asx4zzxwgp97pmzxp"
00:07:29.093 STDOUT [aliyun] tofu:       + security_group_rule_id = (known after apply)
00:07:29.093 STDOUT [aliyun] tofu:       + type                   = "ingress"
00:07:29.093 STDOUT [aliyun] tofu:     }
00:07:29.093 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["tcp:::/0:25565"] will be created
00:07:29.093 STDOUT [aliyun] tofu:   + resource "alicloud_security_group_rule" "this" {
00:07:29.093 STDOUT [aliyun] tofu:       + id                     = (known after apply)
00:07:29.093 STDOUT [aliyun] tofu:       + ip_protocol            = "tcp"
00:07:29.094 STDOUT [aliyun] tofu:       + ipv6_cidr_ip           = "::/0"
00:07:29.094 STDOUT [aliyun] tofu:       + nic_type               = "intranet"
00:07:29.094 STDOUT [aliyun] tofu:       + policy                 = "accept"
00:07:29.094 STDOUT [aliyun] tofu:       + port_range             = "25565/25565"
00:07:29.094 STDOUT [aliyun] tofu:       + prefix_list_id         = (known after apply)
00:07:29.094 STDOUT [aliyun] tofu:       + priority               = 1
00:07:29.094 STDOUT [aliyun] tofu:       + security_group_id      = "sg-bp1asx4zzxwgp97pmzxp"
00:07:29.094 STDOUT [aliyun] tofu:       + security_group_rule_id = (known after apply)
00:07:29.094 STDOUT [aliyun] tofu:       + type                   = "ingress"
00:07:29.094 STDOUT [aliyun] tofu:     }
00:07:29.094 STDOUT [aliyun] tofu: Plan: 2 to add, 0 to change, 0 to destroy.
00:07:29.094 STDOUT [aliyun] tofu: 
```

</details>

**Status**: out of sync :warning:
**Hosts to deploy**: